
<details><summary>Terraform Plan</summary>

```text

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_membership.member["210on"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "210on"
    }

  # github_membership.member["Dodai-Dodai"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "Dodai-Dodai"
    }

  # github_membership.member["I1da725"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "I1da725"
    }

  # github_membership.member["Yosshi72"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "Yosshi72"
    }

  # github_membership.member["hitto-hub"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "hitto-hub"
    }

  # github_membership.member["kerthical"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "kerthical"
    }

  # github_membership.member["konkichi836"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "konkichi836"
    }

  # github_membership.member["kouxi08"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "kouxi08"
    }

  # github_membership.member["meronpannn"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "meronpannn"
    }

  # github_membership.member["mu-ruU1"] will be updated in-place
  ~ resource "github_membership" "member" {
        id       = "ictsc:mu-ruU1"
      ~ role     = "member" -> "admin"
        # (2 unchanged attributes hidden)
    }

  # github_membership.member["onabe3"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "onabe3"
    }

  # github_membership.member["private-yusuke"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "private-yusuke"
    }

  # github_membership.member["shou3008"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "shou3008"
    }

  # github_membership.member["shuumai587"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "shuumai587"
    }

  # github_membership.member["takato256"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "takato256"
    }

  # github_membership.member["tosuke"] will be created
  + resource "github_membership" "member" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "tosuke"
    }

  # github_team.team["ictsc2024"] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = false
      + description               = "member of ictsc2024"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "ictsc2024"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.team_member["Admins"] will be updated in-place
  ~ resource "github_team_members" "team_member" {
        id      = "2008807"
        # (2 unchanged attributes hidden)

      + members {
          + role     = "maintainer"
          + username = "mu-ruU1"
        }
      - members {
          - role     = "member" -> null
          - username = "ecodrive-18" -> null
        }

        # (17 unchanged blocks hidden)
    }

  # github_team_members.team_member["ictsc2023"] will be updated in-place
  ~ resource "github_team_members" "team_member" {
        id      = "8186988"
        # (2 unchanged attributes hidden)

      + members {
          + role     = "maintainer"
          + username = "mu-ruU1"
        }
      - members {
          - role     = "member" -> null
          - username = "asahi-time" -> null
        }
      + members {
          + role     = "member"
          + username = "ecodrive-18"
        }
      + members {
          + role     = "member"
          + username = "meronpannn"
        }
      - members {
          - role     = "member" -> null
          - username = "mu-ruU1" -> null
        }
      + members {
          + role     = "member"
          + username = "shuumai587"
        }
      - members {
          - role     = "member" -> null
          - username = "syuuya-nakatomi" -> null
        }

        # (9 unchanged blocks hidden)
    }

  # github_team_members.team_member["ictsc2024"] will be created
  + resource "github_team_members" "team_member" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "maintainer"
          + username = "Crow314"
        }
      + members {
          + role     = "maintainer"
          + username = "Nishinoyama"
        }
      + members {
          + role     = "maintainer"
          + username = "logica0419"
        }
      + members {
          + role     = "maintainer"
          + username = "mu-ruU1"
        }
      + members {
          + role     = "maintainer"
          + username = "onokatio"
        }
      + members {
          + role     = "maintainer"
          + username = "x86taka"
        }
      + members {
          + role     = "member"
          + username = "210on"
        }
      + members {
          + role     = "member"
          + username = "Art-Atlas"
        }
      + members {
          + role     = "member"
          + username = "Dodai-Dodai"
        }
      + members {
          + role     = "member"
          + username = "Fuuma0000"
        }
      + members {
          + role     = "member"
          + username = "I1da725"
        }
      + members {
          + role     = "member"
          + username = "Yosshi72"
        }
      + members {
          + role     = "member"
          + username = "flora058x"
        }
      + members {
          + role     = "member"
          + username = "hitto-hub"
        }
      + members {
          + role     = "member"
          + username = "kerthical"
        }
      + members {
          + role     = "member"
          + username = "konkichi836"
        }
      + members {
          + role     = "member"
          + username = "kouxi08"
        }
      + members {
          + role     = "member"
          + username = "onabe3"
        }
      + members {
          + role     = "member"
          + username = "private-yusuke"
        }
      + members {
          + role     = "member"
          + username = "shou3008"
        }
      + members {
          + role     = "member"
          + username = "syuuya-nakatomi"
        }
      + members {
          + role     = "member"
          + username = "takato256"
        }
      + members {
          + role     = "member"
          + username = "tosuke"
        }
    }

Plan: 17 to add, 3 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>